# Data Cleaning and Preparation

## Missing Data

In [1]:
import numpy as np
import pandas as pd
from numpy import nan as NA

In [2]:
string_data = pd.Series(['aardvardk', 'artichoke', np.nan, 'avocado'])
string_data

0    aardvardk
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [5]:
data = pd.Series([1, NA, 3.5, NA, 7])
display(data)
data.dropna()

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

0    1.0
2    3.5
4    7.0
dtype: float64

In [6]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
data = pd.DataFrame([[1, 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 5.4, 3.2]])
display(data)
data.dropna()

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  5.4  3.2

     0    1    2
0  1.0  6.5  3.0

In [8]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  5.4  3.2

In [9]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  5.4  3.2 NaN

In [10]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  5.4  3.2

In [11]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -1.447070       NaN       NaN
1  0.790465       NaN       NaN
2  0.423462       NaN -1.244350
3  0.301700       NaN -0.067988
4 -0.369381 -0.058533 -1.277444
5  0.000844  0.037751 -1.979368
6  0.948512 -1.470907 -0.189843

In [12]:
df.dropna()

          0         1         2
4 -0.369381 -0.058533 -1.277444
5  0.000844  0.037751 -1.979368
6  0.948512 -1.470907 -0.189843

In [13]:
df.dropna(thresh=2)

          0         1         2
2  0.423462       NaN -1.244350
3  0.301700       NaN -0.067988
4 -0.369381 -0.058533 -1.277444
5  0.000844  0.037751 -1.979368
6  0.948512 -1.470907 -0.189843

## Filling In Missing Data

In [14]:
df.fillna(0)

          0         1         2
0 -1.447070  0.000000  0.000000
1  0.790465  0.000000  0.000000
2  0.423462  0.000000 -1.244350
3  0.301700  0.000000 -0.067988
4 -0.369381 -0.058533 -1.277444
5  0.000844  0.037751 -1.979368
6  0.948512 -1.470907 -0.189843

In [15]:
df.fillna({1: 5, 2: 0})

          0         1         2
0 -1.447070  5.000000  0.000000
1  0.790465  5.000000  0.000000
2  0.423462  5.000000 -1.244350
3  0.301700  5.000000 -0.067988
4 -0.369381 -0.058533 -1.277444
5  0.000844  0.037751 -1.979368
6  0.948512 -1.470907 -0.189843

In [16]:
df.fillna(0, inplace=True)
df

          0         1         2
0 -1.447070  0.000000  0.000000
1  0.790465  0.000000  0.000000
2  0.423462  0.000000 -1.244350
3  0.301700  0.000000 -0.067988
4 -0.369381 -0.058533 -1.277444
5  0.000844  0.037751 -1.979368
6  0.948512 -1.470907 -0.189843

In [17]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  1.456149  1.580519 -0.947261
1 -0.208974  1.186275  2.201524
2 -0.025789       NaN  0.348898
3  0.527206       NaN -0.202008
4  0.343548       NaN       NaN
5  0.246711       NaN       NaN

In [18]:
df.fillna(method='ffill')

          0         1         2
0  1.456149  1.580519 -0.947261
1 -0.208974  1.186275  2.201524
2 -0.025789  1.186275  0.348898
3  0.527206  1.186275 -0.202008
4  0.343548  1.186275 -0.202008
5  0.246711  1.186275 -0.202008

In [19]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  1.456149  1.580519 -0.947261
1 -0.208974  1.186275  2.201524
2 -0.025789  1.186275  0.348898
3  0.527206  1.186275 -0.202008
4  0.343548       NaN -0.202008
5  0.246711       NaN -0.202008

In [20]:
data = pd.Series([1., NA, 3.4, NA, 6])
data.fillna(data.mean())

0    1.000000
1    3.466667
2    3.400000
3    3.466667
4    6.000000
dtype: float64

## Data Transformations

In [21]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [22]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [23]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [24]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [25]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [26]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces' : [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [27]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [28]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [29]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [30]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

## Replacing Values

In [31]:
data = pd.Series([1, -999, 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [32]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [33]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [34]:
data.replace([-999, -1000], [NA, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## Renaming Axis Indexes

In [35]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [36]:
data.index = data.index.map(lambda x: x[:4].upper())
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [37]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [38]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

## Discretization and Binning

In [39]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [40]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [41]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [42]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [43]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [44]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [45]:
data=np.random.randn(20)
pd.cut(data, 4, precision=2)

[(0.61, 1.36], (-0.88, -0.13], (-0.88, -0.13], (-0.13, 0.61], (0.61, 1.36], ..., (-0.88, -0.13], (-1.63, -0.88], (-1.63, -0.88], (-0.13, 0.61], (-0.13, 0.61]]
Length: 20
Categories (4, interval[float64]): [(-1.63, -0.88] < (-0.88, -0.13] < (-0.13, 0.61] < (0.61, 1.36]]

In [46]:
data = np.random.randn(1000) # Normally distributed
cats = pd.qcut(data, 4) # Cut into quartiles
cats

[(-0.679, -0.103], (-0.679, -0.103], (0.629, 3.298], (-0.679, -0.103], (0.629, 3.298], ..., (-0.679, -0.103], (0.629, 3.298], (0.629, 3.298], (-3.199, -0.679], (-0.679, -0.103]]
Length: 1000
Categories (4, interval[float64]): [(-3.199, -0.679] < (-0.679, -0.103] < (-0.103, 0.629] < (0.629, 3.298]]

In [47]:
pd.value_counts(cats)

(-3.199, -0.679]    250
(-0.679, -0.103]    250
(-0.103, 0.629]     250
(0.629, 3.298]      250
dtype: int64

In [48]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-1.31, -0.103], (-1.31, -0.103], (1.179, 3.298], (-1.31, -0.103], (1.179, 3.298], ..., (-1.31, -0.103], (1.179, 3.298], (-0.103, 1.179], (-1.31, -0.103], (-1.31, -0.103]]
Length: 1000
Categories (4, interval[float64]): [(-3.199, -1.31] < (-1.31, -0.103] < (-0.103, 1.179] < (1.179, 3.298]]

## Detecting and Filtering Ourliers

In [49]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.052570     0.021818    -0.024847     0.008623
std       1.030194     0.989172     0.989751     0.988088
min      -3.461681    -3.150989    -3.355907    -3.003091
25%      -0.757402    -0.611955    -0.691069    -0.685942
50%      -0.063726     0.015239    -0.064286     0.043492
75%       0.627557     0.663393     0.610363     0.710032
max       3.156263     3.786998     3.191354     2.850762

In [50]:
col = data[2]
col[np.abs(col) > 3]

268   -3.355907
529    3.191354
Name: 2, dtype: float64

In [51]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
78  -3.313279  0.621905 -0.380818  0.249463
104  0.140658 -3.099377 -0.257934 -0.516344
268  1.958003  0.552883 -3.355907 -0.944177
300 -1.104773  3.022884 -1.336460 -1.239563
386  3.156263  0.384625 -1.333018 -0.380120
467 -3.244584  1.037313  0.358430 -1.486803
478 -3.461681  0.735389 -0.112919  1.540901
515 -0.932598  3.786998 -2.627953  0.972493
529 -1.252702 -0.316411  3.191354  0.112522
549  0.575598  3.403454  1.016772 -0.074216
582  0.627040  0.644226  0.010260 -3.003091
940  1.864956 -3.150989 -0.759055 -1.405762
963 -1.306579 -3.129815  0.081183  0.061722

In [52]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.iloc[[70, 75, 173, 194], :]

            0         1         2         3
70  -0.035832  0.238294  0.456244 -1.600702
75  -0.580933  0.601405  0.601154  1.696307
173  0.449924 -0.412236 -0.069357  1.192361
194 -1.310266 -0.860424 -2.365719 -0.188871

## Permutation and Random Sampling

In [53]:
df = pd.DataFrame(np.arange(5 * 4). reshape(5, 4))
display(df)

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [54]:
sampler = np.random.permutation(5)
sampler

array([0, 3, 2, 1, 4])

In [55]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
3  12  13  14  15
2   8   9  10  11
1   4   5   6   7
4  16  17  18  19

In [56]:
df.sample(n=3)

    0   1   2   3
4  16  17  18  19
0   0   1   2   3
1   4   5   6   7

In [57]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

1    7
2   -1
2   -1
2   -1
2   -1
3    6
0    5
4    4
1    7
1    7
dtype: int64

## Computing Indicator/Dummy Variables

In [58]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [59]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [60]:
dummies = pd.get_dummies(df['key'], prefix='key')
display(dummies)
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [61]:
np.random.seed(12345)
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [62]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

## String Manipulation

In [63]:
val = 'a,b,   guido'
val.split(',')

['a', 'b', '   guido']

In [64]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [65]:
'::'.join(pieces)

'a::b::guido'

In [66]:
val.index(',')

1

In [67]:
val.find(':')

-1

In [68]:
val.count(',')

2

In [69]:
val.replace(',', '::')

'a::b::   guido'

## Regular Expression

In [70]:
import re
text = "foo   bar\t baz   \tqux"
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [71]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [72]:
regex.findall(text)

['   ', '\t ', '   \t']

In [73]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

In [74]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [75]:
m = regex.search(text)
m

In [76]:
text[m.start():m.end()]

'dave@google.com'

In [77]:
# Match will check the pattern occurs at the start of the string
print(regex.match(text))

None

In [78]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [79]:
# Groups
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)
m = regex.match('esc@test.com')
m.groups()

('esc', 'test', 'com')

In [80]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [81]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

## Vectorized String Functions in pandas

In [82]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [83]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [84]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [85]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [86]:
matches = data.str.findall(pattern, flags=re.IGNORECASE).str[0]
matches

Dave     (dave, google, com)
Steve    (steve, gmail, com)
Rob        (rob, gmail, com)
Wes                      NaN
dtype: object

In [87]:
matches.str.get(1)

Dave     google
Steve     gmail
Rob       gmail
Wes         NaN
dtype: object

In [88]:
data.str.extract(pattern, flags=re.IGNORECASE)

           0       1    2
Dave    dave  google  com
Steve  steve   gmail  com
Rob      rob   gmail  com
Wes      NaN     NaN  NaN